# 4.Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# *Пример:*
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

x = int(input('Введи число: '))


def binary(n):
    if n > 0:
        binary(int(n/2))
        print((n % 2), end="")


binary(x)
