# 3.Задайте список из вещественных чисел.
# Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

# *Пример:*
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19


list1 = [1.1, 1.2, 3.1, 5, 10.01]
list2 = []

for i in list1:
    if isinstance(i, float):
        list2.append(round(abs(i) % 1, 5))

print(max(list2) - min(list2))
